{"pageProps":{"post":"<h1>Why Am I starting yet another blog?</h1>\n<p>Because I'm no longer the Co-Founder of a startup. Although I wish I could have written over the past 3 years while I was one. Honestly there was so much to write about. Quitting my first job to work full-time on our startup which didn't even pay. Having to move back home without a source of income during the pandemic, then moving to Cherthala and living with my Co-Founders for 3 months to speed up our work. Sitting through dozens of pitch meetings, some that didn't even entertain our pitch and some even having us pitch to their Investment Commitee after several rounds only to get rejected at the very end. I could have written about how we spent an entire year with no money building our app running off all the free trials we could get. I could have written about how we got into a VC program and finally got funded at the end of it.</p>\n<p>We pivoted from building a Personal Finance Management app to building a Social Network for Investing. We hired 4 other people and setup an office in Bangalore with our pre-seed fund. Things looked great. We were finally able to pay ourselves a salary even though it was even less than what I was making at my first job. Spent a whole year an a half building out clubfolio, with our team of 7, and grew it to 50k users. Unfortunately the startup market took a bad turn and startups that inflated their numbers now started having to layoff employees and come clean about their actual numbers. All this happened just as we finally started hitting product market fit and was about to starting conversations to raise our next round of funding. Except now every VC in town wanted to see a business with a clear path to revenue sooner than later. Now being a social network we knew we would only have any meaningful revenue at very large scales which is what we were raising money for, to hopefully get to 1m users. But things didn't work out like that, no one funded us, we ran out of money and we hit rock bottom.</p>\n<p>I could have written about all of this, I even thought about it from time to time, when I would be sitting on calls with Gopi and Gokul, when I would be laying awake in bed not knowing what was going to become of our company, what would become of me. When we finally had the phone call about stopping work on clubfolio and looking for other opportunities. When we took the team out for dinner to break the news to them, when we spoke to a dozen other companies about acquiring us or our team. It's been 3 months since we stopped work and we've managed to move our team to another company and integrated into their workforce. Obviously it's not all bad, we've all learned so much along the way, we're working on bigger things, new titles, better pay.</p>\n<p>It's true, nothing will compare to working for yourself, working on the thing you want to build, and feeling like you're actually part of something and not just another employee. Will I start up again? Probably. Will it be any time soon? No.</p>\n<p>So for now, I'm going to take a break and be an employee for a while. Do other things and work on other things that excite me on the side. And hopefully this time around I will have the time to write about it.</p>\n"},"__N_SSG":true}